---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DimensionSegment
source: html/02565f5c-5a38-7cc2-740f-cfa58fd12457.htm
---
# DimensionSegment Members

Causes the object to release immediately any resources it may be utilizing.